TheThingsIndustries/generic-node-se/Software/lib/GNSE_TRACER/adv_tracer/stm32_adv_tracer.c
/**
 ******************************************************************************
 * @file    stm32_adv_tracer.c
 * @author  MCD Application Team
 * @brief   This file contains the advanced trace functions.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "GNSE_tracer.h"
#include "stm32_adv_tracer_conf.h"

#include "stdarg.h"
#include "stdio.h"

/** @addtogroup ADV_TRACER
  * @{
  */

/* Private defines -----------------------------------------------------------*/

/** @defgroup ADV_TRACER_Private_defines ADV_TRACE Privates defines
 *  @{
 */

/**
 *  @brief  memory address of the trace buffer location.
 *  This define can be used, to change the buffer location.
 *
 */
#if !defined(ADV_TRACER_MEMLOCATION)
#define ADV_TRACER_MEMLOCATION
#endif

#if defined(ADV_TRACER_OVERRUN)
/**
 *  @brief  List the overrun status.
 *  list of the overrun status used to handle the overrun trace evacuation.
 *
 *  @note only valid if ADV_TRACER_OVERRUN has been enabled inside utilities conf
 */
typedef enum {
  TRACE_OVERRUN_NONE = 0,     /*!<overrun status none.                        */
  TRACE_OVERRUN_INDICATION,   /*!<overrun status an indication shall be sent. */
  TRACE_OVERRUN_TRANSFERT,    /*!<overrun status data transfer ongoing.       */
  TRACE_OVERRUN_EXECUTED,     /*!<overrun status data transfer complete.      */
} TRACE_OVERRUN_STATUS;
#endif

#if defined(ADV_TRACER_UNCHUNK_MODE)
/**
 *  @brief  List the unchunk status.
 *  list of the unchunk status used to handle the unchunk case.
 *
 *  @note only valid if ADV_TRACER_UNCHUNK_MODE has been enabled inside utilities conf
 */
typedef enum {
  TRACE_UNCHUNK_NONE = 0,     /*!<unchunk status none.                            */
  TRACE_UNCHUNK_DETECTED,     /*!<unchunk status an unchunk has been detected.    */
  TRACE_UNCHUNK_TRANSFER      /*!<unchunk status an unchunk transfer is ongoing. */
} TRACE_UNCHUNK_STATUS;
#endif
/**
  * @}
 */

/**
 *  @brief  advanced macro to override to enable debug mode
 */
#ifndef ADV_TRACER_DEBUG
#define ADV_TRACER_DEBUG(...)
#endif
/* Private macros ------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/

/** @defgroup ADV_TRACER_private_typedef ADV_TRACE private typedef
 *  @{
 */

/**
 *  @brief  ADV_TRACER_Context.
 *  this structure contains all the data to handle the trace context.
 *
 *  @note some part of the context are depend with the selected switch inside the configuration file
 *  ADV_TRACER_UNCHUNK_MODE, ADV_TRACER_OVERRUN, ADV_TRACER_CONDITIONNAL
 */
typedef struct {
#if defined(ADV_TRACER_UNCHUNK_MODE)
  uint16_t unchunk_enabled;                              /*!<unchunck enable.                           */
  TRACE_UNCHUNK_STATUS unchunk_status;                   /*!<unchunk transfer status.                  */
#endif
#if defined(ADV_TRACER_OVERRUN)
  TRACE_OVERRUN_STATUS OverRunStatus;                    /*!<overrun status.                             */
  cb_overrun *overrun_func;                               /*!<overrun function                            */
#endif
#if defined(ADV_TRACER_CONDITIONNAL)
  cb_timestamp *timestamp_func;                           /*!<ptr of function used to insert time stamp. */
  uint8_t CurrentVerboseLevel;                           /*!<verbose level used.                        */
  uint32_t RegionMask;                                   /*!<mask of the enabled region.                */
#endif
  uint16_t TraceRdPtr;                                   /*!<read pointer the trace system.             */
  uint16_t TraceWrPtr;                                   /*!<write pointer the trace system.            */
  uint16_t TraceSentSize;                                /*!<size of the latest transfer.               */
  uint16_t TraceLock;                                    /*!<lock counter of the trace system.          */
} ADV_TRACER_Context;

/**
 *  @}
 */

/* Private variables ---------------------------------------------------------*/
/** @defgroup ADV_TRACER_private_variable ADV_TRACE private variable
 * private variable of the advanced trace system.
 *  @{
 */

/**
 * @brief trace context
 * this variable contains all the internal data of the advanced trace system.
 */
static ADV_TRACER_Context ADV_TRACER_Ctx;
static ADV_TRACER_MEMLOCATION uint8_t ADV_TRACER_Buffer[ADV_TRACER_FIFO_SIZE];

#if defined(ADV_TRACER_CONDITIONNAL) && defined(ADV_TRACER_UNCHUNK_MODE)
/**
 * @brief temporary buffer used by ADV_TRACER_COND_FSend
 * a temporary buffers variable used to evaluate a formatted string size.
 */
static uint8_t sztmp[ADV_TRACER_TMP_BUF_SIZE];
#endif
/**
 * @}
 */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup ADV_TRACER_private_function ADV_TRACE private function
 *
 *  @{
 */
static void TRACE_TxCpltCallback(void *Ptr);
static int16_t TRACE_AllocateBufer(uint16_t Size, uint16_t *Pos);
static ADV_TRACER_Status_t TRACE_Send(void);

static void TRACE_Lock(void);
static void TRACE_UnLock(void);
static uint32_t TRACE_IsLocked(void);

/**
  * @}
  */

/* Functions Definition ------------------------------------------------------*/

/** @addtogroup ADV_TRACER_exported_function
 *  @{
 */
ADV_TRACER_Status_t ADV_TRACER_Init(void)
{
  /* initialize the Ptr for Read/Write */
  (void)ADV_TRACER_MEMSET8(&ADV_TRACER_Ctx, 0x0, sizeof(ADV_TRACER_Context));
  (void)ADV_TRACER_MEMSET8(&ADV_TRACER_Buffer, 0x0, sizeof(ADV_TRACER_Buffer));

#if defined(ADV_TRACER_UNCHUNK_MODE)
  ADV_TRACER_DEBUG("\nUNCHUNK_MODE\n");
#endif
  /* Allocate Lock resource */
  ADV_TRACER_INIT_CRITICAL_SECTION();

  /* Initialize the Low Level interface */
  return UTIL_TraceDriver.Init(TRACE_TxCpltCallback);
}

ADV_TRACER_Status_t ADV_TRACER_DeInit(void)
{
  /* Un-initialize the Low Level interface */
  return UTIL_TraceDriver.DeInit();
}

ADV_TRACER_Status_t ADV_TRACER_StartRxProcess(void (*UserCallback)(uint8_t *PData, uint16_t Size, uint8_t Error))
{
  /* start the RX process */
  return UTIL_TraceDriver.StartRx(UserCallback);
}

