TheThingsIndustries/generic-node-se/Software/lib/GNSE_TRACER/adv_tracer/stm32_adv_tracer.c
#if defined(ADV_TRACER_CONDITIONNAL)
ADV_TRACER_Status_t ADV_TRACER_COND_FSend(uint32_t VerboseLevel, uint32_t Region, uint32_t TimeStampState, const char *strFormat, ...)
{
  va_list vaArgs;
#if defined(ADV_TRACER_UNCHUNK_MODE)
  uint8_t buf[ADV_TRACER_TMP_MAX_TIMESTMAP_SIZE];
  uint16_t timestamp_size = 0u;
  uint16_t writepos;
  uint16_t idx;
#else
  uint8_t buf[ADV_TRACER_TMP_BUF_SIZE+ADV_TRACER_TMP_MAX_TIMESTMAP_SIZE];
#endif
  uint16_t buff_size = 0u;

  /* check verbose level */
  if (!( ADV_TRACER_Ctx.CurrentVerboseLevel >= VerboseLevel))
  {
    return ADV_TRACER_GIVEUP;
  }

  if(( Region & ADV_TRACER_Ctx.RegionMask) != Region)
  {
    return ADV_TRACER_REGIONMASKED;
  }

#if defined(ADV_TRACER_UNCHUNK_MODE)
  if((ADV_TRACER_Ctx.timestamp_func != NULL) && (TimeStampState != 0u))
  {
    ADV_TRACER_Ctx.timestamp_func(buf,&timestamp_size);
  }

  va_start( vaArgs, strFormat);
  buff_size =(uint16_t)ADV_TRACER_VSNPRINTF((char *)sztmp,ADV_TRACER_TMP_BUF_SIZE, strFormat, vaArgs);

  TRACE_Lock();

  /* if allocation is ok, write data into the buffer */
  if (TRACE_AllocateBufer((buff_size+timestamp_size),&writepos) != -1)
  {
#if defined(ADV_TRACER_OVERRUN)
    ADV_TRACER_ENTER_CRITICAL_SECTION();
    if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
    {
      /* clear the over run */
      ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
    }
    ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif

    /* copy the timestamp */
    for (idx = 0u; idx < timestamp_size; idx++)
    {
      ADV_TRACER_Buffer[writepos] = buf[idx];
      writepos = writepos + 1u;
    }

    /* copy the data */
    (void)ADV_TRACER_VSNPRINTF((char *)(&ADV_TRACER_Buffer[writepos]), ADV_TRACER_TMP_BUF_SIZE, strFormat, vaArgs);
    va_end(vaArgs);

    TRACE_UnLock();

    return TRACE_Send();
  }

  va_end(vaArgs);
  TRACE_UnLock();
#if defined(ADV_TRACER_OVERRUN)
  ADV_TRACER_ENTER_CRITICAL_SECTION();
  if((ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACER_Ctx.overrun_func))
  {
    ADV_TRACER_DEBUG("ADV_TRACER_Send:TRACE_OVERRUN_INDICATION");
    ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
  }
  ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif

  return ADV_TRACER_MEM_FULL;

#else
  if((ADV_TRACER_Ctx.timestamp_func != NULL) && (TimeStampState != 0u))
  {
    ADV_TRACER_Ctx.timestamp_func(buf,&buff_size);
  }

  va_start( vaArgs, strFormat);
  buff_size+=(uint16_t)ADV_TRACER_VSNPRINTF((char *)(buf + buff_size), ADV_TRACER_TMP_BUF_SIZE, strFormat, vaArgs);
  va_end(vaArgs);

  return ADV_TRACER_Send(buf, buff_size);
#endif
}
#endif

ADV_TRACER_Status_t ADV_TRACER_FSend(const char *strFormat, ...)
{
  uint8_t buf[ADV_TRACER_TMP_BUF_SIZE];
  va_list vaArgs;

  va_start( vaArgs, strFormat);
  uint16_t bufSize=(uint16_t)ADV_TRACER_VSNPRINTF((char *)buf ,ADV_TRACER_TMP_BUF_SIZE, strFormat, vaArgs);
  va_end(vaArgs);

  return ADV_TRACER_Send(buf, bufSize);
}

#if defined(ADV_TRACER_CONDITIONNAL)
ADV_TRACER_Status_t ADV_TRACER_COND_ZCSend_Allocation(uint32_t VerboseLevel, uint32_t Region, uint32_t TimeStampState, uint16_t length, uint8_t **pData, uint16_t *FifoSize, uint16_t *WritePos)
{
  ADV_TRACER_Status_t ret = ADV_TRACER_OK;
  uint16_t writepos;
  uint8_t timestamp_ptr[ADV_TRACER_TMP_MAX_TIMESTMAP_SIZE];
  uint16_t timestamp_size = 0u;

  /* check verbose level */
  if (!( ADV_TRACER_Ctx.CurrentVerboseLevel >= VerboseLevel))
  {
    return ADV_TRACER_GIVEUP;
  }

  if(( Region & ADV_TRACER_Ctx.RegionMask) != Region)
  {
	  return ADV_TRACER_REGIONMASKED;
  }

  if((ADV_TRACER_Ctx.timestamp_func != NULL) && (TimeStampState != 0u))
  {
	  ADV_TRACER_Ctx.timestamp_func(timestamp_ptr,&timestamp_size);
  }

  TRACE_Lock();

  /* if allocation is ok, write data into the buffer */
  if (TRACE_AllocateBufer(length+timestamp_size, &writepos) != -1)
  {
#if defined(ADV_TRACER_OVERRUN)
    ADV_TRACER_ENTER_CRITICAL_SECTION();
    if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
    {
      /* clear the over run */
	    ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
    }
    ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif

    /* fill time stamp information */
    for(uint16_t index = 0u; index < timestamp_size; index++)
    {
      ADV_TRACER_Buffer[writepos] = timestamp_ptr[index];
      writepos = (uint16_t)((writepos + 1u) % ADV_TRACER_FIFO_SIZE);
    }

    /*user fill */
    *pData = ADV_TRACER_Buffer;
    *FifoSize = (uint16_t)ADV_TRACER_FIFO_SIZE;
    *WritePos = writepos;
  }
  else
  {
#if defined(ADV_TRACER_OVERRUN)
    ADV_TRACER_ENTER_CRITICAL_SECTION();
    if((ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACER_Ctx.overrun_func))
    {
      ADV_TRACER_DEBUG(":TRACE_OVERRUN_INDICATION");
      ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
    }
    ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif
    TRACE_UnLock();
    ret = ADV_TRACER_MEM_FULL;
  }
  return ret;
}

ADV_TRACER_Status_t ADV_TRACER_COND_ZCSend_Finalize(void)
{
	return ADV_TRACER_ZCSend_Finalize();
}
#endif

ADV_TRACER_Status_t ADV_TRACER_ZCSend_Allocation(uint16_t Length, uint8_t **pData, uint16_t *FifoSize, uint16_t *WritePos)
{
  ADV_TRACER_Status_t ret = ADV_TRACER_OK;
  uint16_t writepos;

  TRACE_Lock();

  /* if allocation is ok, write data into the buffer */
  if (TRACE_AllocateBufer(Length,&writepos)  != -1)
  {
#if defined(ADV_TRACER_OVERRUN)
	ADV_TRACER_ENTER_CRITICAL_SECTION();
	if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
	{
		/* clear the over run */
	    ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
	}
	ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif

	/*user fill */
	*pData = ADV_TRACER_Buffer;
	*FifoSize = ADV_TRACER_FIFO_SIZE;
	*WritePos = (uint16_t)writepos;
  }
  else
  {
#if defined(ADV_TRACER_OVERRUN)
	ADV_TRACER_ENTER_CRITICAL_SECTION();
	if((ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACER_Ctx.overrun_func))
	{
		ADV_TRACER_DEBUG("ADV_TRACER_ZCSend:TRACE_OVERRUN_INDICATION");
		ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
	}
	ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif
    TRACE_UnLock();
    ret = ADV_TRACER_MEM_FULL;
  }

  return ret;
}

ADV_TRACER_Status_t ADV_TRACER_ZCSend_Finalize(void)
{
    TRACE_UnLock();
    return TRACE_Send();
}

