TheThingsIndustries/generic-node-se/Software/lib/GNSE_TRACER/adv_tracer/stm32_adv_tracer.c
#if defined(ADV_TRACER_CONDITIONNAL)
ADV_TRACER_Status_t ADV_TRACER_COND_Send(uint32_t VerboseLevel, uint32_t Region, uint32_t TimeStampState, const uint8_t *pData, uint16_t Length)
{
  ADV_TRACER_Status_t ret;
  uint16_t writepos;
  uint32_t  idx;
  uint8_t timestamp_ptr[ADV_TRACER_TMP_MAX_TIMESTMAP_SIZE];
  uint16_t timestamp_size = 0u;

  /* check verbose level */
  if (!( ADV_TRACER_Ctx.CurrentVerboseLevel >= VerboseLevel))
  {
	return ADV_TRACER_GIVEUP;
  }

  if(( Region & ADV_TRACER_Ctx.RegionMask) != Region)
  {
	  return ADV_TRACER_REGIONMASKED;
  }

  if((ADV_TRACER_Ctx.timestamp_func != NULL) && (TimeStampState != 0u))
  {
	  ADV_TRACER_Ctx.timestamp_func(timestamp_ptr,&timestamp_size);
  }

  TRACE_Lock();

  /* if allocation is ok, write data into the buffer */
  if (TRACE_AllocateBufer(Length + timestamp_size, &writepos) != -1)
  {
#if defined(ADV_TRACER_OVERRUN)
    ADV_TRACER_ENTER_CRITICAL_SECTION();
    if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
    {
      /* clear the over run */
	    ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
    }
    ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif

    /* fill time stamp information */
    for( idx = 0; idx < timestamp_size; idx++)
    {
      ADV_TRACER_Buffer[writepos] = timestamp_ptr[idx];
      writepos = (uint16_t)((writepos + 1u) % ADV_TRACER_FIFO_SIZE);
    }

    for (idx = 0u; idx < Length; idx++)
    {
      ADV_TRACER_Buffer[writepos] = pData[idx];
      writepos = (uint16_t)((writepos + 1u) % ADV_TRACER_FIFO_SIZE);
    }

    TRACE_UnLock();
    ret = TRACE_Send();
  }
  else
  {
	TRACE_UnLock();
#if defined(ADV_TRACER_OVERRUN)
	ADV_TRACER_ENTER_CRITICAL_SECTION();
	if((ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACER_Ctx.overrun_func))
	{
		ADV_TRACER_DEBUG("ADV_TRACER_Send:TRACE_OVERRUN_INDICATION");
		ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
	}
	ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif
    ret = ADV_TRACER_MEM_FULL;
  }

  return ret;
}
#endif

ADV_TRACER_Status_t ADV_TRACER_Send(const uint8_t *pData, uint16_t Length)
{
  ADV_TRACER_Status_t ret;
  uint16_t writepos;
  uint32_t  idx;

  TRACE_Lock();

  /* if allocation is ok, write data into the buffer */
  if (TRACE_AllocateBufer(Length,&writepos) != -1)
  {

#if defined(ADV_TRACER_OVERRUN)
	ADV_TRACER_ENTER_CRITICAL_SECTION();
    if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_EXECUTED)
    {
      /* clear the over run */
	    ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_NONE;
    }
    ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif

    /* initialize the Ptr for Read/Write */
    for (idx = 0u; idx < Length; idx++)
    {
      ADV_TRACER_Buffer[writepos] = pData[idx];
      writepos = (uint16_t)((writepos + 1u) % ADV_TRACER_FIFO_SIZE);
    }
    TRACE_UnLock();

    ret = TRACE_Send();
  }
  else
  {
	TRACE_UnLock();
#if defined(ADV_TRACER_OVERRUN)
	ADV_TRACER_ENTER_CRITICAL_SECTION();
	if((ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_NONE ) && (NULL != ADV_TRACER_Ctx.overrun_func))
	{
		ADV_TRACER_DEBUG("ADV_TRACER_Send:TRACE_OVERRUN_INDICATION");
		ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_INDICATION;
	}
	ADV_TRACER_EXIT_CRITICAL_SECTION();
#endif

    ret = ADV_TRACER_MEM_FULL;
  }

  return ret;
}

#if defined(ADV_TRACER_OVERRUN)
void ADV_TRACER_RegisterOverRunFunction(cb_overrun *cb)
{
	ADV_TRACER_Ctx.overrun_func = *cb;
}
#endif

#if defined(ADV_TRACER_CONDITIONNAL)
void ADV_TRACER_RegisterTimeStampFunction(cb_timestamp *cb)
{
	ADV_TRACER_Ctx.timestamp_func = *cb;
}

void ADV_TRACER_SetVerboseLevel(uint8_t Level)
{
	ADV_TRACER_Ctx.CurrentVerboseLevel = Level;
}

uint8_t ADV_TRACER_GetVerboseLevel(void)
{
	return ADV_TRACER_Ctx.CurrentVerboseLevel;
}

void ADV_TRACER_SetRegion(uint32_t Region)
{
	ADV_TRACER_Ctx.RegionMask|= Region;
}

uint32_t ADV_TRACER_GetRegion(void)
{
	return ADV_TRACER_Ctx.RegionMask;
}

void ADV_TRACER_ResetRegion(uint32_t Region)
{
	ADV_TRACER_Ctx.RegionMask&= ~Region;
}
#endif

__WEAK void ADV_TRACER_PreSendHook (void)
{
}

__WEAK void ADV_TRACER_PostSendHook (void)
{
}

/**
 * @}
 */

/** @addtogroup ADV_TRACER_private_function
 *  @{
 */

/**
  * @brief send the data of the trace to low layer
  * @retval Status based on @ref ADV_TRACER_Status_t
  */
static ADV_TRACER_Status_t TRACE_Send(void)
{
  ADV_TRACER_Status_t ret = ADV_TRACER_OK;
  uint8_t *ptr = NULL;

  ADV_TRACER_ENTER_CRITICAL_SECTION();

  if(TRACE_IsLocked() == 0u)
  {
    TRACE_Lock();

#if defined(ADV_TRACER_OVERRUN)
	if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_INDICATION )
	{
		ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_TRANSFERT;
	    ADV_TRACER_EXIT_CRITICAL_SECTION();
	    ADV_TRACER_PreSendHook();

	    ADV_TRACER_Ctx.overrun_func(&ptr, &ADV_TRACER_Ctx.TraceSentSize);
	    ADV_TRACER_DEBUG("\n--TRACE_Send overrun(%d)--\n", ADV_TRACER_Ctx.TraceSentSize);
	    return UTIL_TraceDriver.Send(ptr, ADV_TRACER_Ctx.TraceSentSize);
	}
#endif

    if (ADV_TRACER_Ctx.TraceRdPtr != ADV_TRACER_Ctx.TraceWrPtr)
    {
#ifdef ADV_TRACER_UNCHUNK_MODE
   	  if(TRACE_UNCHUNK_DETECTED == ADV_TRACER_Ctx.unchunk_status)
   	  {
        ADV_TRACER_Ctx.TraceSentSize = (uint16_t)(ADV_TRACER_Ctx.unchunk_enabled - ADV_TRACER_Ctx.TraceRdPtr);
        ADV_TRACER_Ctx.unchunk_status = TRACE_UNCHUNK_TRANSFER;
        ADV_TRACER_Ctx.unchunk_enabled = 0;

        ADV_TRACER_DEBUG("\nTRACE_TxCpltCallback::unchunk start(%d,%d)\n",ADV_TRACER_Ctx.unchunk_enabled, ADV_TRACER_Ctx.TraceRdPtr);

        if (0u == ADV_TRACER_Ctx.TraceSentSize)
        {
          ADV_TRACER_Ctx.unchunk_status = TRACE_UNCHUNK_NONE;
          ADV_TRACER_Ctx.TraceRdPtr = 0;
        }
   	  }

   	  if(TRACE_UNCHUNK_NONE == ADV_TRACER_Ctx.unchunk_status)
   	  {
#endif
   	    if (ADV_TRACER_Ctx.TraceWrPtr > ADV_TRACER_Ctx.TraceRdPtr)
        {
   	    	ADV_TRACER_Ctx.TraceSentSize = ADV_TRACER_Ctx.TraceWrPtr - ADV_TRACER_Ctx.TraceRdPtr;
        }
        else  /* TraceRdPtr > TraceWrPtr */
        {
        	ADV_TRACER_Ctx.TraceSentSize = ADV_TRACER_FIFO_SIZE - ADV_TRACER_Ctx.TraceRdPtr;

