TheThingsIndustries/generic-node-se/Software/lib/GNSE_TRACER/adv_tracer/stm32_adv_tracer.c
        }
#ifdef ADV_TRACER_UNCHUNK_MODE
      }
#endif
      ptr = &ADV_TRACER_Buffer[ADV_TRACER_Ctx.TraceRdPtr];

      ADV_TRACER_EXIT_CRITICAL_SECTION();
      ADV_TRACER_PreSendHook();

      ADV_TRACER_DEBUG("\n--TRACE_Send(%d-%d)--\n",ADV_TRACER_Ctx.TraceRdPtr, ADV_TRACER_Ctx.TraceSentSize);
      ret = UTIL_TraceDriver.Send(ptr, ADV_TRACER_Ctx.TraceSentSize);
    }
    else
    {
      TRACE_UnLock();
      ADV_TRACER_EXIT_CRITICAL_SECTION();
    }
  }
  else
  {
    ADV_TRACER_EXIT_CRITICAL_SECTION();
  }

  return ret;
}

/**
  * @brief Tx callback called by the low layer level to inform a transfer complete
  * @param Ptr pointer not used only for HAL compatibility
  * @retval none
  */
static void TRACE_TxCpltCallback(void *Ptr)
{
  ADV_TRACER_ENTER_CRITICAL_SECTION();

#if defined(ADV_TRACER_OVERRUN)
  if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_TRANSFERT )
  {
    ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_EXECUTED;
    ADV_TRACER_DEBUG("\n--TRACE_Send overrun complete--\n");
    ADV_TRACER_Ctx.TraceSentSize = 0u;
  }
#endif

#if defined(ADV_TRACER_UNCHUNK_MODE)
  if(TRACE_UNCHUNK_TRANSFER == ADV_TRACER_Ctx.unchunk_status)
  {
	  ADV_TRACER_Ctx.unchunk_status = TRACE_UNCHUNK_NONE;
	  ADV_TRACER_Ctx.TraceRdPtr = 0;
	  ADV_TRACER_DEBUG("\nTRACE_TxCpltCallback::unchunk complete\n");
  }
  else
  {
	  ADV_TRACER_Ctx.TraceRdPtr = (ADV_TRACER_Ctx.TraceRdPtr + ADV_TRACER_Ctx.TraceSentSize) % ADV_TRACER_FIFO_SIZE;
  }
#else
  ADV_TRACER_Ctx.TraceRdPtr = (ADV_TRACER_Ctx.TraceRdPtr + ADV_TRACER_Ctx.TraceSentSize) % ADV_TRACER_FIFO_SIZE;
#endif

#if defined(ADV_TRACER_OVERRUN)
	if(ADV_TRACER_Ctx.OverRunStatus == TRACE_OVERRUN_INDICATION )
	{
		uint8_t *ptr = NULL;

		ADV_TRACER_Ctx.OverRunStatus = TRACE_OVERRUN_TRANSFERT;
		ADV_TRACER_EXIT_CRITICAL_SECTION();
		ADV_TRACER_Ctx.overrun_func(&ptr, &ADV_TRACER_Ctx.TraceSentSize);
		ADV_TRACER_DEBUG("\n--Driver_Send overrun(%d)--\n", ADV_TRACER_Ctx.TraceSentSize);
		UTIL_TraceDriver.Send(ptr, ADV_TRACER_Ctx.TraceSentSize);
    return;
	}
#endif

  if((ADV_TRACER_Ctx.TraceRdPtr != ADV_TRACER_Ctx.TraceWrPtr) && (1u == ADV_TRACER_Ctx.TraceLock))
  {
#ifdef ADV_TRACER_UNCHUNK_MODE
    if(TRACE_UNCHUNK_DETECTED == ADV_TRACER_Ctx.unchunk_status)
    {
   		ADV_TRACER_Ctx.TraceSentSize = ADV_TRACER_Ctx.unchunk_enabled - ADV_TRACER_Ctx.TraceRdPtr;
   		ADV_TRACER_Ctx.unchunk_status = TRACE_UNCHUNK_TRANSFER;
   		ADV_TRACER_Ctx.unchunk_enabled = 0;

    	ADV_TRACER_DEBUG("\nTRACE_TxCpltCallback::unchunk start(%d,%d)\n",ADV_TRACER_Ctx.unchunk_enabled, ADV_TRACER_Ctx.TraceRdPtr);

    	if (0u == ADV_TRACER_Ctx.TraceSentSize)
      {
        ADV_TRACER_Ctx.unchunk_status = TRACE_UNCHUNK_NONE;
        ADV_TRACER_Ctx.TraceRdPtr = 0;
      }
    }

    if(TRACE_UNCHUNK_NONE == ADV_TRACER_Ctx.unchunk_status)
    {
#endif
      if (ADV_TRACER_Ctx.TraceWrPtr > ADV_TRACER_Ctx.TraceRdPtr)
      {
        ADV_TRACER_Ctx.TraceSentSize = ADV_TRACER_Ctx.TraceWrPtr - ADV_TRACER_Ctx.TraceRdPtr;
      }
      else  /* TraceRdPtr > TraceWrPtr */
      {
        ADV_TRACER_Ctx.TraceSentSize = ADV_TRACER_FIFO_SIZE - ADV_TRACER_Ctx.TraceRdPtr;
      }
#ifdef ADV_TRACER_UNCHUNK_MODE
    }
#endif
    ADV_TRACER_EXIT_CRITICAL_SECTION();
    ADV_TRACER_DEBUG("\n--TRACE_Send(%d-%d)--\n", ADV_TRACER_Ctx.TraceRdPtr, ADV_TRACER_Ctx.TraceSentSize);
    UTIL_TraceDriver.Send(&ADV_TRACER_Buffer[ADV_TRACER_Ctx.TraceRdPtr], ADV_TRACER_Ctx.TraceSentSize);
  }
  else
  {
    ADV_TRACER_PostSendHook();
    ADV_TRACER_EXIT_CRITICAL_SECTION();
    TRACE_UnLock();
  }
}

/**
  * @brief  allocate space inside the buffer to push data
  * @param  Size to allocate within fifo
  * @param  Pos position within the fifo
  * @retval write position inside the buffer is -1 no space available.
  */
static int16_t TRACE_AllocateBufer(uint16_t Size, uint16_t *Pos)
{
  uint16_t freesize;
  int16_t ret = -1;

  ADV_TRACER_ENTER_CRITICAL_SECTION();

  if (ADV_TRACER_Ctx.TraceWrPtr == ADV_TRACER_Ctx.TraceRdPtr)
  {
#ifdef ADV_TRACER_UNCHUNK_MODE
    freesize = (uint16_t)(ADV_TRACER_FIFO_SIZE - ADV_TRACER_Ctx.TraceWrPtr);
    if((Size >= freesize) && (ADV_TRACER_Ctx.TraceRdPtr > Size))
    {
      ADV_TRACER_Ctx.unchunk_status = TRACE_UNCHUNK_DETECTED;
      ADV_TRACER_Ctx.unchunk_enabled = ADV_TRACER_Ctx.TraceWrPtr;
      freesize = ADV_TRACER_Ctx.TraceRdPtr;
      ADV_TRACER_Ctx.TraceWrPtr = 0;
    }
#else
    /* need to add buffer full management*/
    freesize = (int16_t)ADV_TRACER_FIFO_SIZE;
#endif
  }
  else
  {
#ifdef ADV_TRACER_UNCHUNK_MODE
    if (ADV_TRACER_Ctx.TraceWrPtr > ADV_TRACER_Ctx.TraceRdPtr)
    {
      freesize = (uint16_t)(ADV_TRACER_FIFO_SIZE - ADV_TRACER_Ctx.TraceWrPtr);
      if((Size >= freesize) && (ADV_TRACER_Ctx.TraceRdPtr > Size))
      {
        ADV_TRACER_Ctx.unchunk_status = TRACE_UNCHUNK_DETECTED;
        ADV_TRACER_Ctx.unchunk_enabled = ADV_TRACER_Ctx.TraceWrPtr;
        freesize = ADV_TRACER_Ctx.TraceRdPtr;
        ADV_TRACER_Ctx.TraceWrPtr = 0;
      }
    }
    else
    {
      freesize = (uint16_t)(ADV_TRACER_Ctx.TraceRdPtr - ADV_TRACER_Ctx.TraceWrPtr);
    }
#else
    if (ADV_TRACER_Ctx.TraceWrPtr > ADV_TRACER_Ctx.TraceRdPtr)
    {
      freesize = ADV_TRACER_FIFO_SIZE - ADV_TRACER_Ctx.TraceWrPtr + ADV_TRACER_Ctx.TraceRdPtr;
    }
    else
    {
      freesize = ADV_TRACER_Ctx.TraceRdPtr - ADV_TRACER_Ctx.TraceWrPtr;
    }
#endif
  }

  if (freesize > Size)
  {
    *Pos = ADV_TRACER_Ctx.TraceWrPtr;
    ADV_TRACER_Ctx.TraceWrPtr = (ADV_TRACER_Ctx.TraceWrPtr + Size) % ADV_TRACER_FIFO_SIZE;
    ret = 0;

#ifdef ADV_TRACER_UNCHUNK_MODE
    ADV_TRACER_DEBUG("\n--TRACE_AllocateBufer(%d-%d-%d::%d-%d)--\n",freesize - Size, Size, ADV_TRACER_Ctx.unchunk_enabled, ADV_TRACER_Ctx.TraceRdPtr, ADV_TRACER_Ctx.TraceWrPtr);
#else
    ADV_TRACER_DEBUG("\n--TRACE_AllocateBufer(%d-%d::%d-%d)--\n",freesize - Size, Size, ADV_TRACER_Ctx.TraceRdPtr, ADV_TRACER_Ctx.TraceWrPtr);
#endif
  }

  ADV_TRACER_EXIT_CRITICAL_SECTION();
  return ret;
}

/**
  * @brief  Lock the trace buffer.
  * @retval None.
  */
static void TRACE_Lock(void)
{
  ADV_TRACER_ENTER_CRITICAL_SECTION();
  ADV_TRACER_Ctx.TraceLock++;
  ADV_TRACER_EXIT_CRITICAL_SECTION();
}

/**
  * @brief  UnLock the trace buffer.
  * @retval None.
  */
static void TRACE_UnLock(void)
{
  ADV_TRACER_ENTER_CRITICAL_SECTION();
  ADV_TRACER_Ctx.TraceLock--;
  ADV_TRACER_EXIT_CRITICAL_SECTION();
}

/**
  * @brief  UnLock the trace buffer.
  * @retval None.
  */
static uint32_t TRACE_IsLocked(void)
{
  return (ADV_TRACER_Ctx.TraceLock == 0u? 0u: 1u);
}

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
